In [6]:
import pandas as pd
import numpy as np

In [2]:
names = [
    "Alice", "Bob", "Charlie", "Diana", "Ethan",
    "Fiona", "George", "Hannah", "Ian", "Julia",
    "Kevin", "Laura", "Michael", "Nina", "Oscar",
    "Paula", "Quentin", "Rachel", "Steve", "Tina"
]
ages = [
    15, 16, 15, 17, 16,
    15, 17, 16, 15, 17,
    16, 15, 17, 16, 15,
    17, 16, 15, 17, 16
]

marks = [
    78, 85, 92, 74, 88,
    95, 67, 80, 90, 73,
    82, 96, 68, 87, 91,
    77, 84, 93, 70, 89
]


students = {
    "name" : names,
    "age" : ages,
    "marks": marks

}
print(students)

{'name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Fiona', 'George', 'Hannah', 'Ian', 'Julia', 'Kevin', 'Laura', 'Michael', 'Nina', 'Oscar', 'Paula', 'Quentin', 'Rachel', 'Steve', 'Tina'], 'age': [15, 16, 15, 17, 16, 15, 17, 16, 15, 17, 16, 15, 17, 16, 15, 17, 16, 15, 17, 16], 'marks': [78, 85, 92, 74, 88, 95, 67, 80, 90, 73, 82, 96, 68, 87, 91, 77, 84, 93, 70, 89]}

show 5 rows

In [7]:
data = pd.DataFrame(students);

In [8]:
print(data)

       name  age  marks
0     Alice   15     78
1       Bob   16     85
2   Charlie   15     92
3     Diana   17     74
4     Ethan   16     88
5     Fiona   15     95
6    George   17     67
7    Hannah   16     80
8       Ian   15     90
9     Julia   17     73
10    Kevin   16     82
11    Laura   15     96
12  Michael   17     68
13     Nina   16     87
14    Oscar   15     91
15    Paula   17     77
16  Quentin   16     84
17   Rachel   15     93
18    Steve   17     70
19     Tina   16     89

In [9]:
print(data.head())

      name  age  marks
0    Alice   15     78
1      Bob   16     85
2  Charlie   15     92
3    Diana   17     74
4    Ethan   16     88

print only names and marks

In [12]:
print(data[["name","marks"]])

       name  marks
0     Alice     78
1       Bob     85
2   Charlie     92
3     Diana     74
4     Ethan     88
5     Fiona     95
6    George     67
7    Hannah     80
8       Ian     90
9     Julia     73
10    Kevin     82
11    Laura     96
12  Michael     68
13     Nina     87
14    Oscar     91
15    Paula     77
16  Quentin     84
17   Rachel     93
18    Steve     70
19     Tina     89

filter students with marks > 80

In [19]:
print(data["marks"] > 80)

high_scorers = data[data["marks"] > 80]
print(high_scorers["name"])
print(high_scorers)

0     False
1      True
2      True
3     False
4      True
5      True
6     False
7     False
8      True
9     False
10     True
11     True
12    False
13     True
14     True
15    False
16     True
17     True
18    False
19     True
Name: marks, dtype: bool
1         Bob
2     Charlie
4       Ethan
5       Fiona
8         Ian
10      Kevin
11      Laura
13       Nina
14      Oscar
16    Quentin
17     Rachel
19       Tina
Name: name, dtype: object
       name  age  marks
1       Bob   16     85
2   Charlie   15     92
4     Ethan   16     88
5     Fiona   15     95
8       Ian   15     90
10    Kevin   16     82
11    Laura   15     96
13     Nina   16     87
14    Oscar   15     91
16  Quentin   16     84
17   Rachel   15     93
19     Tina   16     89

Load a CSV file (or create dummy data). Example: sales.csv with product,
quantity, price.â€‹

In [8]:


np.random.seed(42)


products = ["Laptop", "Mouse", "Keyboard", "Monitor", "Headphones"]
data_large = {
    "product": np.random.choice(products, 50),
    "quantity": np.random.randint(1, 15, 50),
    "price": np.random.choice([800, 20, 50, 150, 70], 50)
}

df_large = pd.DataFrame(data_large)


file_path_large = "/home/shariya/pandas-practice-task/sales.csv"
df_large.to_csv(file_path_large, index=False)

df_large.head(10)

      product  quantity  price
0     Monitor        12    800
1  Headphones        12    800
2    Keyboard         7    800
3  Headphones        12    800
4  Headphones        13    150
5       Mouse         8     50
6    Keyboard         3     50
7    Keyboard        14    800
8    Keyboard         1     50
9  Headphones         4     50

In [24]:


df_large["total"] = df_large['quantity'] * df_large['price']
total_sales = df_large.groupby("product")["total"].sum().reset_index()
print(total_sales)

      product  total
0  Headphones  32510
1    Keyboard  51600
2      Laptop   5430
3     Monitor  23050
4       Mouse  21330

In [25]:
temperatures = pd.Series([30, 32, 28, 25, 27], index=["Day1", "Day2", "Day3", "Day4", "Day5"],name="Temperature")

temperatures

Day1    30
Day2    32
Day3    28
Day4    25
Day5    27
Name: Temperature, dtype: int64

In [26]:
temperatures_f = temperatures * 9/5 + 32

temperatures_f

Day1    86.0
Day2    89.6
Day3    82.4
Day4    77.0
Day5    80.6
Name: Temperature, dtype: float64

In [28]:
temperatures_f.max()

np.float64(89.6)

In [29]:
temperatures_f.min()

np.float64(77.0)

In [30]:
temperatures.mean()

np.float64(28.4)